// Цикл for()

// for (let i = 0; i <= 10; i += 1) {
//     console.log(i);
// }

// Задача 1 
// Напиши скрипт який підраховує загальну суму зарплат робітників.
// кількість робітників зберігається в змінній employees
// Зарплата кожного робітника це випадкове число від 500 до 5000
// Записати суму  у змінну totalSalary і вивести в консоль

// // 1 Оголошуємо змінну для зберігання зп працівників
// const employees = 4;
// let totalSalary = 0;
// const minSalary = 500;
// const maxSalary = 5000;

// // 2 Циклом for() перебираємо зп від 500 до 5000
// for (let i = 1; i <= employees; i += 1){
//     // 3 Згенерувати випадкову зп
// const salary = Math.round(Math.random() * (maxSalary - minSalary) + minSalary);
//     console.log(`Зп робітника номер ${i} - ${salary}`);
//     // 4 Добавити до тоталу
//     totalSalary += salary;
// }

// // 5 console.log() 
// console.log('totalSalary:', totalSalary);

// Задача 2 
// Напиши скрипт який підраховує суму всіх парних чисел
// які входять в діапазон чисел в змінних від min до max
// Наприклад якщо min=0 і max=5, то в ньому два парних числа 2-4

// // 1 Оголошуємо змінні
// const minNumber = 6;
// const maxNumber = 13;
// let total = 0;
// // 2 Перебираємо циклом for() від min до max 
// for( let i = minNumber; i <= maxNumber; i += 2){
//     console.log(i);
//     // 3 Додаємо до тотала
// total += i;
// }
// // 5 логуємо
// console.log('Сума всіх парних чисел', total);

// // 1 Оголошуємо змінні
// const minNumber = 6;
// const maxNumber = 13;
// let total = 0;
// // 2 Перебираємо циклом for() від min до max 
// for( let i = minNumber; i <= maxNumber; i += 1){
//     // 3 перевіряємо на парні числа
//     if (i % 2 === 0) {
//         console.log('Парне:', i);
//         //4 Додаємо до тотала
//         total += i;
//     } 
// }
// // 5 логуємо
// console.log('Сума всіх парних чисел', total);

// 1 Оголошуємо змінні
// const minNumber = 6;
// const maxNumber = 13;
// let total = 0;
// // 2 Перебираємо циклом for() від min до max 
// for( let i = minNumber; i <= maxNumber; i += 1){
//     // 3 перевіряємо на непарні числа
//     if (i % 2 !== 0) {
//         // console.log('Непарне:', i);
//         continue;
//     } 
//     //4 логуємо парні числа
//     console.log('Парне:', i);
// //5 Додаємо до тотала
//         total += i; //total = 0 + 6.total = 6 + 8. total = 14 + 10.total = 24 + 12. total = 36.
// }
// // 6 логуємо
// console.log('Сума всіх парних чисел', total);

//  Задача 3
// Напиши скрипт обробки покупки в магазині
// Баланс користувача зберігається в змінній balance
// Сума покупки в змінній payment
// перед перевіркою вивести повідомлення:
// "Загальна вартість замовлення [число] кредитів. Перевіряємо кількістьдоступних коштів на рахунку"
// якщо сума покупки не перевищує баланс
// -вирахувати з балансу суму покупки
// Вивести повідомлення "На рахунку залишилося [число] кредитів"
// якщо сума покупки перевищує баланс "На рахунку недостатньо коштів для виконання операції!"
// В кінці вивести "Операція завершена"

// 1 Змінні
// let balance = 10000;
// const payment = 2000;
// let totalPayment = 0;
// // 2 Умова якщо сума <= баланс
// console.log(`Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількістьдоступних коштів на рахунку...`);
// if(balance >= payment) {
//     console.log('Все гаразд, знімаємо гроші... Дякуємо за покупку!');
//     balance -= payment;
//     console.log(`На рахунку залишилося ${balance} кредитів.`);
// } else {
//     console.log("На рахунку недостатньо коштів для виконання операції!");
// }
// console.log("Операція завершена.");

//  Задача 4
// Напиши скрипт підрахунку суми покупки зі знижкою в залежності
// від потраченої суми за весь час (партнерська програма)

// -Загальна сума потраченого зберігається в змінній totalSpend
// -сума поточної покупки зберігається в payment
// -знижки зберігаються в discount

// -якщо потрачено від [100 до 1000] -бронзовий партнер знижка 2%
// -якщо потрачено від [1000 дo 5000] -срібний партнер знижка 5%
// -якщо потрачено більше [5000] - золотий партнер знижка 10%
// -якщо потрачено менше [100] - не партнер знижка 0%

//  в результаті вивести повідомлення "оформлюємо замовлення на суму [сума] зі знижкою [скидка%]"

// 1 змінні
// let totalSpend = 5000  ;
// let payment = 2000  ;
// let discount = 0;

// // 2 if()
// if(totalSpend < 100) {
//     console.log('не партнер знижка 0%'); 
// } else if(totalSpend >= 100 && totalSpend < 1000) {
//     console.log('бронзовий партнер знижка 2%');
//     discount = 0.02;
// } else if (totalSpend >= 1000 && totalSpend < 5000) {
//     console.log('срібний партнер знижка 5%')
//     discount = 0.05;
// } else {
//     console.log('золотий партнер знижка 10%');
//     discount = 0.1;
// } 

// payment -= payment * discount;

// console.log(`оформлюємо замовлення на суму ${payment} зі знижкою ${discount * 100}%!`);
// totalSpend += payment;
// console.log('totalSpend:', totalSpend);

// const stars = 5;
// let price;

// if (stars === 1 || stars === 2) {
//     price = 10;
// } else if (stars === 2 || stars === 3) {
//     price = 20;
// } else if (stars === 3 || stars === 4) {
//     price = 30;
// } else if (stars === 5) {
//     price = 120;
// } else {
//     price = "такої кількості зірок немає";
// }

// console.log(price);

// switch(stars) {
//     case 1:
//     case 2: 
//     price = 10;
//     break;
    
//     case 3: 
//     case 4: 
//     price = 30;
//     break;

//     case 5: 
//     price = 120;
//     break;
//     default:
//     console.log("такої кількості зірок немає")
// }

// console.log(price)

// const option = 1;

// let message ="";

// switch(option) {
//     case 1: 
//     message ="Ви можете забрати товар завтра з 12:00 в нашому офісі";
//     break;
//     case 2:
//     message = "Курєр доставить замовлення завтра з 9:00 по 18:00";
//     break;
//     case 3 : 
//     message = 'Посилка буде відправлена сьогодні';
//     break;
//     default: {
//         console.log("Вам зателефонує менеджер");
//     }
// }
// console.log(message);
